## [텍스트 데이터 처리 ]  
- 다양한 형태의 텍스트 데이터를 정리하기 위한 방법들
- Series와 str 속성을 활용해서 str 제공 전용 메서드 사용 가능
- 사용방법 : Series 객체.str메서드()

- 문자열 관련 메서드들 살펴보기  
(1) 공백 제거 관련 메서드 => strip(),lstrip(),rstrip()

In [9]:
msg="   Merry Christmas     "

In [10]:
len(msg) # 공백 포함

23

In [11]:
msg1, msg2, msg3 = msg.strip(), msg.lstrip(), msg.rstrip()

In [13]:
len(msg1), len(msg2), len(msg3) # msg1: 좌우 공백 삭제 -8 / msg2: 좌 공백 삭제 -3 / msg3: 우 공백 삭제 -5

(15, 20, 18)

(1) 모듈 로딩 <hr>

In [14]:
import pandas as pd

(2) 데이터 준비 <hr>

In [15]:
file='../DATA/chicago_food_inspections.csv'

(3) 데이터 저장 <hr>

In [16]:
chicagoDF=pd.read_csv(file)
chicagoDF

                                      Name             Risk
0               MARRIOT MARQUIS CHICAGO       Risk 1 (High)
1                              JETS PIZZA   Risk 2 (Medium)
2                               ROOM 1520      Risk 3 (Low)
3                MARRIOT MARQUIS CHICAGO      Risk 1 (High)
4                            CHARTWELLS       Risk 1 (High)
...                                    ...              ...
153805                         WOLCOTT'S      Risk 1 (High)
153806     DUNKIN DONUTS/BASKIN-ROBBINS     Risk 2 (Medium)
153807                           Cafe 608     Risk 1 (High)
153808                        mr.daniel's     Risk 1 (High)
153809                         TEMPO CAFE     Risk 1 (High)

[153810 rows x 2 columns]

(4) 데이터 확인 <hr>

In [17]:
chicagoDF.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 153810 entries, 0 to 153809
Data columns (total 2 columns):
 #   Column  Non-Null Count   Dtype
---  ------  --------------   -----
 0   Name    153810 non-null  object
 1   Risk    153744 non-null  object
dtypes: object(2)
memory usage: 2.3+ MB

In [19]:
chicagoDF.head()

                          Name             Risk
0   MARRIOT MARQUIS CHICAGO       Risk 1 (High)
1                  JETS PIZZA   Risk 2 (Medium)
2                   ROOM 1520      Risk 3 (Low)
3    MARRIOT MARQUIS CHICAGO      Risk 1 (High)
4                CHARTWELLS       Risk 1 (High)

- [ 문제 ] : Name 컬럼에서 공백제거 처리

In [23]:
chicagoDF['Name']=chicagoDF['Name'].str.strip()

In [24]:
chicagoDF['Name']

0              MARRIOT MARQUIS CHICAGO
1                           JETS PIZZA
2                            ROOM 1520
3              MARRIOT MARQUIS CHICAGO
4                           CHARTWELLS
                      ...
153805                       WOLCOTT'S
153806    DUNKIN DONUTS/BASKIN-ROBBINS
153807                        Cafe 608
153808                     mr.daniel's
153809                      TEMPO CAFE
Name: Name, Length: 153810, dtype: object

- [문제] : Risk 컬럼에서 문자열 나누기 ==> Risk 숫자 ==> Risk 숫자 분리

In [25]:
chicagoDF['Risk'].nunique(), chicagoDF['Risk'].unique()

(4,
 array(['Risk 1 (High)', 'Risk 2 (Medium)', 'Risk 3 (Low)', 'All', nan],
       dtype=object))

In [26]:
chicagoDF['Risk'].isna().sum()

66

In [27]:
chicagoDF.isna().sum()

Name     0
Risk    66
dtype: int64

In [30]:
# 기본 => 행 방향, 행 내에 한개라도 NaN있으면 삭제
chicagoDF.dropna().shape

(153744, 2)

In [31]:
# Risk 컬럼이 NaN인 행 삭제 => subset 피라미터 적용
chicagoDF.dropna(subset=['Risk']).shape

(153744, 2)

In [32]:
# 원소의 데이터 값이 'all' => 'Risk 4(Extreme)'변경
chicagoDF['Risk'].replace('all', 'Risk4(Extreme)')

0           Risk 1 (High)
1         Risk 2 (Medium)
2            Risk 3 (Low)
3           Risk 1 (High)
4           Risk 1 (High)
               ...
153805      Risk 1 (High)
153806    Risk 2 (Medium)
153807      Risk 1 (High)
153808      Risk 1 (High)
153809      Risk 1 (High)
Name: Risk, Length: 153810, dtype: object

In [35]:
chicagoDF['Risk'].str.slice()

0           Risk 1 (High)
1         Risk 2 (Medium)
2            Risk 3 (Low)
3           Risk 1 (High)
4           Risk 1 (High)
               ...
153805      Risk 1 (High)
153806    Risk 2 (Medium)
153807      Risk 1 (High)
153808      Risk 1 (High)
153809      Risk 1 (High)
Name: Risk, Length: 153810, dtype: object